gstroe/Harmony/gfx/lcc/firmware/src/system_config/pic32mx_usb_sk2_lcc_pictail_wqvga/framework/driver/gfx/controller/lcc/drv_gfx_lcc_generic.c
		case OVERFLOW: //Adjust the address lines that aren't part of PMP
            GraphicsState = prevGraphicsState;     //goto Front Porch
		#ifdef ADDR15
            ADDR15 = ++overflowcount;          //count holds the additional address line count
            ADDR16 = (overflowcount>>1);
		#else
			ADDR16 = overflowcount;
		#endif
            break;

        case BLANKING_PERIOD:   //Front Porch then Back Porch Start
            HSYNC = 0;
            DATA_ENABLE = 0;
            GraphicsState = PMDIN;
            while(PMMODEbits.BUSY == 1);
            HSYNC = 1;
            VSYNC = 1;
            //Setup DMA Back Porch
            remaining = HBackPorch;
            GraphicsState = ACTIVE_PERIOD;
            line++;
            DCH1CSIZ = 1;
            break;

        default:
            break;
    }

    //Setup DMA Transfer
    PLIB_DMA_ChannelXDestinationSizeSet(DMA_ID_0, DRV_GFX_LCC_DMA_CHANNEL_INDEX, (uint16_t) (remaining << 1));
    PLIB_DMA_ChannelXINTSourceFlagClear(DMA_ID_0, DRV_GFX_LCC_DMA_CHANNEL_INDEX, DMA_INT_BLOCK_TRANSFER_COMPLETE);
    SYS_DMA_ChannelEnable(dmaHandle);
}

// *****************************************************************************
/*
  Function: void DRV_GFX_LCC_PixelPut(uint16_t x, uint16_t y)

  Summary:
    outputs one pixel into the frame buffer at the x,y coordinate given

  Description:
    none

  Input:
        x,y - pixel coordinates
  Output:
    1 - call not successful (lcc driver busy)
    0 - call successful
*/
void DRV_GFX_LCC_PixelPut(uint16_t x, uint16_t y)
{
    _frameAddress = (uint32_t)(((y)*(DISP_HOR_RESOLUTION))+(x));
    LCCSaveData();

    PMDIN = drvLCCObj.initData->color;
    LCCRecoverData();
}

// *****************************************************************************
/*
  Function: void DRV_GFX_LCC_BarFill(uint16_t left, uint16_t top, uint16_t right, uint16_t bottom)

  Summary:
    outputs one pixel into the frame buffer at the x,y coordinate given

  Description:
    none

  Input:
        left,top - pixel coordinates
        right, bottom - pixel coordinates

  Output:
          1 - call not successful (lcc driver busy)
          0 - call successful
*/
void  DRV_GFX_LCC_BarFill(uint16_t left, uint16_t top, uint16_t right, uint16_t bottom)
{
    uint16_t lineCount = bottom - top + 1;//vchange;
    uint16_t count = right - left + 1;//hchange;
    _frameAddress = (uint32_t)(((top)*(DISP_HOR_RESOLUTION))+(left));

    while(lineCount)
    {
       for(_pixelRendercount = count; _pixelRendercount > 0; _pixelRendercount--)
       {
			/*Suspend DMA Trigger*/
			LCCSaveData();
			if((_pixelRendercount > 8) && (PMADDR < PMP_ADDRESS_LINES-8)) //Write 8 pixels at once
			{
				PMDIN = drvLCCObj.initData->color; while(PMMODEbits.BUSY == 1);
				PMDINSET = 0; while(PMMODEbits.BUSY == 1);
				PMDINSET = 0; while(PMMODEbits.BUSY == 1);
				PMDINSET = 0; while(PMMODEbits.BUSY == 1);
				PMDINSET = 0;
				_frameAddress += 7;
				PMDINSET = 0;
				_pixelRendercount -= 7;
				PMDINSET = 0; while(PMMODEbits.BUSY == 1);
				PMDINSET = 0;
			}
			else
			{
			   PMDIN = drvLCCObj.initData->color;
			}
			LCCRecoverData();
			_frameAddress++;
       }
       _frameAddress += (DISP_HOR_RESOLUTION - count);
       lineCount--;
    }
}

// *****************************************************************************
/*
  Function: void  DRV_GFX_LCC_PixelArrayPut(uint16_t *color, uint16_t x, uint16_t y, uint16_t count)

  Summary:
    outputs an array of pixels of length count starting at *color

  Description:
    none

  Input:
          instance - driver instance
          *color - start of the array
                  x - x coordinate of the start point.
                  y - y coordinate of the end point.
                  count - number of pixels
  Output:
         handle to the number of pixels remaining
*/
void  DRV_GFX_LCC_PixelArrayPut(GFX_COLOR *color, uint16_t x, uint16_t y, uint16_t count, uint16_t lineCount)
{
    _frameAddress = (uint32_t)(((y)*(DISP_HOR_RESOLUTION))+(x));

    while(lineCount)
    {
       for(_pixelRendercount = count; _pixelRendercount > 0; _pixelRendercount--)
       {
			/*Suspend DMA Trigger*/
			LCCSaveData();
			if((_pixelRendercount > 4) && (PMADDR < PMP_ADDRESS_LINES-8)) //Write 8 pixels at once
			{
				PMDIN = *color++;
				_pixelRendercount -= 3;
				PMDIN = *color++;
				_frameAddress += 3;
				PMDIN = *color++;
				while(PMMODEbits.BUSY==1);
			}

	        PMDIN =  *color++;
			LCCRecoverData();
			_frameAddress++;
       }
       _frameAddress += (DISP_HOR_RESOLUTION - count);
       lineCount--;
    }
}

// *****************************************************************************
/*
  Function: uint16_t*  DRV_GFX_LCC_PixelArrayGet(uint16_t *color, uint16_t x, uint16_t y, uint16_t count)

  Summary:
    outputs an array of pixels of length count starting at *color

  Description:
    none

  Input:
          instance - driver instance
          *color - start of the array
                  x - x coordinate of the start point.
                  y - y coordinate of the end point.
                  count - number of pixels
  Output:
         handle to the number of pixels remaining
*/
uint16_t*  DRV_GFX_LCC_PixelArrayGet(GFX_COLOR *color, uint16_t x, uint16_t y, uint16_t count)
{
     _frameAddress =  (uint32_t)(((y)*(DISP_HOR_RESOLUTION))+(x));
    while(count)
    {
		/*Suspend DMA Trigger*/
		LCCSaveData();
        PMCONCLR = 0x0100;

        *color = PMDIN;
                while(PMMODEbits.BUSY==1);
        *color++ = PMDIN;

        if((count > 4) && (PMADDR < PMP_ADDRESS_LINES-8)) //Write 8 pixels at once
        {
                *color++ = PMDIN;
                _frameAddress += 3;
                *color++ = PMDIN;
                count -= 3;
                *color++ = PMDIN;

        }
        while(PMMODEbits.BUSY==1);
        PMCONSET = 0x0100;
        LCCRecoverData();

        _frameAddress++;
        count--;
	}
    return 0;
}

uint16_t*  DRV_GFX_LCC_Layer(uint8_t instance, GFX_LAYER_PARAMS* layer)
{
    GFXPIPPage = layer->page;

   if(layer->on == 0)
   {
       PipVLength = 0;
       return 0;
   }
    PipStartL = layer->left;
    PipStartT = layer->top;
    PipVLength = layer->height;
    PipHLength = layer->width;
    PipX = layer->layerLeft;
    PipY = layer->layerTop;
    return 0;
}

uint16_t prevaddr;

