gstroe/Harmony/gfx/lcc/firmware/src/system_config/pic32mx_usb_sk2_lcc_pictail_wqvga/framework/driver/gfx/controller/lcc/drv_gfx_lcc_generic.c
inline void LCCSaveData(void)
{
    while(DCH1CSIZ != 1);
    while(DrawCount > PIXEL_DRAW_PER_DMA_TX);
    DMACONbits.SUSPEND = 1;
    while(PMMODEbits.BUSY == 1); //WAIT for DMA transfer to be suspended
    //Perform Write
#ifdef ADDR15
    ADDR15 = _frameAddress >> 15; //.bits.b15;
#endif
    ADDR16 = _frameAddress >> 16; //taskIndex->address.bits.b16;
    ADDR17 = drvLCCObj.initData->activePage;
    ADDR18 = drvLCCObj.initData->activePage>>1;

    //Save previous address value
    prevaddr = PMADDR;
    PMADDR = _frameAddress;
}

inline void LCCRecoverData(void)
{
    //Clean-up Address Lines
#ifdef ADDR15
    ADDR15 = overflowcount;          //count holds the additional address line count
    ADDR16 = (overflowcount>>1);
#else
	ADDR16 = overflowcount;
#endif
    ADDR17 = drvLCCObj.initData->visualPage;
    ADDR18 = drvLCCObj.initData->visualPage>>1;
    PMADDR = prevaddr;
    DMACONbits.SUSPEND = 0;
    DrawCount++;
}

// *****************************************************************************
/* Function:
    SYS_STATUS DRV_GFX_LCC_Status ( SYS_MODULE_OBJ object )

  Summary:
    Returns status of the specific module instance of the Driver module.

  Description:
    This function returns the status of the specific module instance disabling its
    operation (and any hardware for driver modules).

  PreCondition:
    The DRV_GFX_LCC_Initialize function should have been called before calling
    this function.

  Parameters:
    object          - DRV_GFX_LCC object handle, returned from DRV_GFX_LCC_Initialize

  Returns:
    SYS_STATUS_READY    Indicates that any previous module operation for the
                        specified module has completed

    SYS_STATUS_BUSY     Indicates that a previous module operation for the
                        specified module has not yet completed

    SYS_STATUS_ERROR    Indicates that the specified module is in an error state
*/

SYS_STATUS DRV_GFX_LCC_Status ( SYS_MODULE_OBJ object )
{
    DRV_GFX_LCC_OBJ *dObj = (DRV_GFX_LCC_OBJ*)object;
    return ( dObj->state );

} /* SYS_TMR_Status */

